<template>
  <div id="hot" ref="list">
    <div class="card" v-for="(item, index) in hotList" :key="index">
      <a class="title" :href="item.link">
        <h2>{{ item.title }}</h2>
      </a>
      <div class="content">
        <a class="text" href>
          {{ checkText(item.content) }}
          <a class="all">
            阅读全文
            <i class="el-icon-arrow-down"></i>
          </a>
        </a>
        <a :href="item.link" class="image" v-if="item.picture">
          <img style="width: 190px; height: 105px" :src="item.picture" />
        </a>
      </div>
      <div class="footer">
        <div class="right">
          <a>
            <i class="el-icon-magic-stick"></i>
            {{ item.heat }} 热度
          </a>
          <a> <i class="el-icon-s-promotion"></i>分享 </a>
        </div>
      </div>
    </div>
    <!-- <div class="card" v-loading="loading" style="height: 80px" v-show="loading"></div> -->
  </div>
</template>

<script>
export default {
  name: 'HotView',
  data() {
    return {
      hotList: [],
      // lock: false,
      loading: true
    }
  },
  mounted() {
    this.getList()
    // window.addEventListener('scroll', this.handleScroll)
  },
  methods: {
    checkText(str) {
      const l = str.replace(/[\u0391-\uFFE5]/g, 'aa').length
      if (l > 130) return str.substring(0, 130) + '...'
      return str
    },
    getList() {
      this.hotList = [
        {
          id: 1,
          title: '「月薪 1.4 万招不到机械专业学生，公司感叹工资这么高了还招不到人」？',
          heat: 156,
          link: 'www.baidu.com',
          content:
            '招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。',
          picture: 'https://fakeimg.pl/190x150/619ac3/'
        },
        {
          id: 2,
          title: '中央政治局会议强调，支持各地从当地实际出发完善房地产政策',
          heat: 156,
          link: 'www.baidu.com',
          content:
            '中共中央政治局4月29日召开会议，分析研究当前经济形势和经济工作，审议《国家“十四五”期间人才发展规划》。会议强调，要有效管控重点风险，守住不发生系统性风险底线。要坚持房子是用来住的、不是用来炒的定位，支持各地从当地实际出发完善房地产政策，支持刚性和改善性住房需求，优化商品房预售资金监管，促进房地产市场平稳健康发展。要及时回应市场关切，稳步推进股票发行注册制改革，积极引入长期投资者，保持资本市场平稳运行。要促进平台经济健康发展，完成平台经济专项整改，实施常态化监管，出台支持平台经济规范健康发展的具体措施。（央视新闻）招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。',
          picture: 'https://fakeimg.pl/190x150/619ac3/'
        },
        {
          id: 3,
          title: '我儿子15岁，不想学习了，想去打乒乓，他得过全省单打冠军招工难',
          heat: 156,
          link: 'www.baidu.com',
          content:
            '招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。',
          picture: 'https://fakeimg.pl/190x150/619ac3/'
        },
        {
          id: 4,
          title: '北京一男子得知自己密接后独守车内，小区 14 小时后即解封',
          heat: 156,
          link: 'www.baidu.com',
          content:
            '近日一服务平台APP宣布为女性用户开始招聘更多女性工程师，许多女性网友反应自己看到女性服务者“安全感爆棚”！招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。',
          picture: 'https://fakeimg.pl/190x150/619ac3/'
        },
        {
          id: 5,
          title: '都说《英雄联盟手游》凉了，为什么它还能有不错的吸金能力？',
          heat: 156,
          link: 'www.baidu.com',
          content:
            '居住在冠华苑4区6号楼的感染者218在接到疾控部门电话告知自己是密接后，立即向街道、社区报备，并留在自驾车内等候通知，未进小区。这一行为帮助冠华苑社区第一时间排查疫情，连夜进行核酸检测确保阴性后第一时间解封，目前社区运行一切正常。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。招工难，是几乎所有制造企业共同的呼声。广东外贸制造中小企业招工现场，老板比求职的工人还多；北京央企说，年轻人不愿意进工厂。制造巨头吐槽，开出“前所未有”的高薪依然抢不到人然而，工人紧缺的另一面是就业难，特别是千万级应届大学生就业难。这一结构性矛盾清楚地表明，不少人对工人的认知依旧停留在20世纪八九十年代流水线服装女工的水平，“脏繁重累”的集体记忆尚未消除，新的多元、自由就业理念又形成新的冲击，曾经一岗难求的制造业似乎不再是就业的首选。',
          picture: 'https://fakeimg.pl/190x150/619ac3/'
        }
      ]
    }
  }
}
</script>

<style scoped>
a {
  color: black;
  text-decoration: none;
}

.card {
  padding: 20px;
  border-bottom: 1px solid #f0f2f7;
  display: flex;
  flex-direction: column;
  box-sizing: border-box;
}

.content {
  margin-top: 5px;
  margin-bottom: 5px;
  display: flex;
  justify-content: space-between;
}

.title {
  margin-bottom: 5px;
}

.title:hover {
  color: #175199;
}

.text {
  font-size: 15px;
  flex: 1 1;
}

.text:hover {
  color: #646464;
}

.image {
  margin-left: 20px;
}

.footer {
  margin-top: 5px;
  display: flex;
  align-items: center;
}

.el-button {
  color: #0084ff;
  background: rgba(0, 132, 255, 0.1);
  border-color: transparent;
  padding: 10px;
  box-sizing: border-box;
}

.el-button:hover {
  background-color: rgba(0, 132, 255, 0.15);
}

i {
  padding-right: 5px;
}

.right a {
  margin-right: 25px;
  font-size: 15px;
  color: #73859a;
  cursor: pointer;
}

.right a:hover {
  color: #62788e;
}

.all {
  color: #175199;
  font-size: 14px;
}

.all:hover {
  color: #646464;
}

.user {
  cursor: pointer;
  display: flex;
  align-items: center;
  margin-bottom: 10px;
}
</style>
